{
  "architectures": [
    "TransformersForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_param2moe.Param2MoEConfig",
    "AutoModel": "modeling_param2moe.Param2MoEModel",
    "AutoModelForCausalLM": "modeling_param2moe.Param2MoEForCausalLM"
  },
  "model_type": "param2moe",
  "embedding_dropout": 0.0,
  "eos_token_id": 3,
  "first_k_dense_replace": 1,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 9216,
  "max_position_embeddings": 4096,
  "max_window_layers": 20,
  "moe_intermediate_size": 2048,
  "moe_router_enable_expert_bias": true,
  "moe_shared_expert_intermediate_size": 4096,
  "mtp_loss_scaling_factor": 0,
  "n_group": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 32,
  "num_experts": 64,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 21,
  "num_key_value_heads": 8,
  "num_nextn_predict_layers": 0,
  "num_shared_experts": 2,
  "output_dropout": 0.0,
  "output_router_logits": false,
  "pad_token_id": 0,
  "partial_rotary_factor": 1.0,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "routed_scaling_factor": 2.5,
  "router_dtype": "fp32",
  "score_function": "sigmoid",
  "tie_word_embeddings": true,
  "topk_group": 1,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.2",
  "use_bias": false,
  "use_cache": true,
  "use_qk_norm": true,
  "use_qkv_bias": false,
  "use_rmsnorm": true,
  "vocab_size": 128008
}
